import requests
import sys
import json
from mistralai import Mistral

api_key = "ZWSBeFyf4tkpZ8UbRXtVLrDRjDkHiN1X"
client = Mistral(api_key=api_key)

chat_response = client.chat.complete(
    model= "mistral-large-latest",
    messages = [
        {
            "role": "user",
            "content": 
                f"""
                Сгенерируй 5 вопросов по тексту, к каждому C неправильных и A правильный ответ
                Шаблон вопроса:
                [номер вопроса]. [вопрос]
                Ответы:
                A. [ответ A]
                B. [ответ B]
                C. [ответ C]
                D. [ответ D]
                Правильный ответ: [буква правильного ответа]
                Дальше идет текст и не надо добавлять его в ответ. Вопросы и ответ только на русском.
                Текст: Пул потоков (thread pool) в Java - это механизм, который позволяет эффективно управлять и переиспользовать потоки для выполнения задач. Он представляет собой пул заранее созданных потоков, готовых к выполнению задач.\nВместо создания нового потока каждый раз, когда требуется выполнить задачу, пул потоков предоставляет готовые потоки из пула. Задача передается одному из свободных потоков для выполнения. После завершения задачи поток возвращается обратно в пул и может быть использован для выполнения следующей задачи
                """,
        },
    ]
)
print(chat_response.choices[0].message.content)