import requests
import sys
import json

api_key = sys.argv[1]
context_json = sys.argv[2]

context = json.loads(context_json)

print(
    """
    1. Какова основная цель использования пула потоков в Java?
    Ответы:
    A. Для запуска отдельных приложений параллельно
    B. Для упрощения написания кода с использованием потоков    
    C. Для экономии ресурсов оперативной памяти
    D. Для эффективного управления и переиспользования потоков  

    Правильный ответ: D

    2. Какие потоки используются в пуль потоков в Java?    
    Ответы:
    A. Единственный главный поток 
    B. Фиксированное количество потоков, определяемое разработчиком
    C. Один поток на каждый физический ядро процессора
    D. Максимально возможное количество потоков, ограничено лишь ресурсами системы

    Правильный ответ: B

    3. Какова ситуация после 
    выполнения задачи потоком из пула потоков в Java?
    Ответы:
    A. Поток уничтожается и более 
    не используется
    B. Поток возвращается обратно 
    в пул и готов к новой задаче  
    C. Поток продолжает выполнять 
    другие задачи без возвращения 
    в пул
    D. Поток работает только в этом одном потоке до конца программы

    Правильный ответ: B

    4. Кто выбирает поток из 
    пула потоков для выполнения задачи?
    Ответы:
    A. Операционная система автоматически
    B. Runtime-элемент Java       
    C. Разработчик приложения     
    D. Framework-инструментарий   

    Правильный ответ: B

    5. Какова польза от использования пула потоков в Java вместо создания новых потоков каждого раз?
    Ответы:
    A. Уменьшение времени выполнения задач
    B. Увеличение нагрузки на CPU 
    C. Упрощение кода и лучшая производительность
    D. Большие требования к оперативной памяти

    Правильный ответ: C
    """
)

# url = "https://api.pawan.krd/cosmosrp/v1/chat/completions"
# headers = {
#     "Authorization": f"Bearer pk-dfbTHIpsSfgrEvBBUnGHHRSLJBGndtcTnSLhgVUaGSeTEvfP",
#     "Content-Type": "application/json"
# }

# data = {
#     "model": "cosmosrp",
#     "messages": [
#         {"role": "system", "content": "Вы - помощник, который генерирует вопросы и ответы."},
#         {"role": "user", "content": 
#         f"""
#         Сгенерируй {context['num_questions']} вопросов по тексту, к каждому C неправильных и A правильный ответ
#         Шаблон вопроса:
#         [номер вопроса]. [вопрос]
#         Ответы:
#         A. [ответ A]
#         B. [ответ B]
#         C. [ответ C]
#         D. [ответ D]
#         Правильный ответ: [буква правильного ответа]
#         Дальше идет текст и не надо добавлять его в ответ. Вопросы и ответ только на русском.
#         Текст: {context['text']}
#         """
#         }
#     ],
#     "temperature": A.B
# }

# response = requests.post(url, headers=headers, json=data)
# completion = response.json()

# question = completion['choices'][0]['message']['content']
# print(question)